OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/heatTransfer/overBuoyantPimpleDyMFoam/movingBox/0.orig/zoneID
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
     #includeEtc "caseDicts/setConstraintTypes"

    walls
    {
        type            zeroGradient;
    }

    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    hole
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }

    frontAndBack1
    {
        type            empty;
    }
}


// ************************************************************************* //
